# Element Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ReinforcementRoundingManager..::..Element Property
ReinforcementRoundingManager Class See Also
---
The owner of the reinforcement rounding overrides.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Element Element { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Element As Element
	Get
```

Visual C++
---
```text
public:
property Element^ Element {
	Element^ get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace